Documents/упКорректировкаЭтаповПеревозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упКорректировкаЭтаповПеревозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЗаявкиКВыполнению</xr:Item>
				<xr:Item>InformationRegister.упПрерыванияГрузовыхПотоков</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаПеревозкуГруза</xr:Item>
				<xr:Item>InformationRegister.упПлановыеЭтапыПеревозки</xr:Item>
				<xr:Item>InformationRegister.УдалитьупПлановыеЭтапыМультимодальнойПеревозки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененияПлановПеревозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботыАдресаОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботыАдресаПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаПолучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГрузов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицоЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицоОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицоПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентОтправителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтрагентПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВЦепиПоставок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВЦепиПоставокКонец</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработкаПрерывания</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлениеГрузаПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлениеГрузаС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучениеГрузаПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучениеГрузаС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПриоритетыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Соглашение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаМультимодальнойПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСхемыМультимодальныхПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПеревозки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасовойПояс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упЗаявкиКВыполнению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упЗаявкиКВыполнению</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СхемаМультимодальнойПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСхемыМультимодальныхПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрузовоеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВЦепиПоставок</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВЦепиПоставокКонец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерВЦепиПоставок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/упСтатусыЗаявокНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыЗаявокНаПеревозкуГруза</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗаявкиНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/упКорректировкаЭтаповПеревозки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		
		Отказ = Истина
			   И РежимЗаписи = РежимЗаписиДокумента.Проведение
			   И РежимПроведения = РежимПроведенияДокумента.Неоперативный;
		
		Если Отказ Тогда
			ТекстСообщения = Нстр("ru = 'Запрещено неоперативное проведение документа.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
			Событие = Нстр("ru = 'Ошибка при корректировке этапов перевозки'");
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);    
		КонецЕсли;
		
		Если Не Отказ Тогда
			Отказ = упКорректировкаЭтаповПеревозки.ЗапрещеноРедактироватьЭтапыМультимодальнойПеревозки(ЭтотОбъект);
		КонецЕсли;
		
		Если Истина
			И Не Отказ
			И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		Тогда
		
			ТекстОшибки = "";
			упКорректировкаЭтаповПеревозки.ОтменитьЗаданияНаПеревозкуПоЭтапам(ЭтотОбъект, ТекстОшибки, Отказ);	
			
		КонецЕсли;
		
	КонецЕсли;
		
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	сткРеквизиты = Новый Структура();
	сткРеквизиты.Вставить("ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки", "ВидПеревозки.ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки");
	сткДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаявкаНаПеревозкуГруза, сткРеквизиты);
	ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки = сткДанные.ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки;
	ДополнительныеСвойства.Вставить("ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки", ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки);
		
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЗаявкиКВыполнению");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Заявка", ЗаявкаНаПеревозкуГруза);
	
	Если ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПлановыеЭтапыПеревозки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);
	КонецЕсли;
		
	тбзПрерыванияГрузовыхПотоков = Неопределено;
	Если ДополнительныеСвойства.Свойство("ПрерыванияГрузовыхПотоков", тбзПрерыванияГрузовыхПотоков) Тогда
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПрерыванияГрузовыхПотоков");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);
	КонецЕсли;
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	РеквизитыОбъекта = Новый Структура(); 
	РеквизитыОбъекта.Вставить("Дата", Дата);
	РеквизитыОбъекта.Вставить("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);
	РеквизитыОбъекта.Вставить("ИзмененияПлановПеревозки", ИзмененияПлановПеревозки);
	
	ДвиженияЗаданияНаПеревозку = Движения.упЗаявкиКВыполнению;
	ДвиженияЗаданияНаПеревозку.Очистить();	
	ДвиженияЗаданияНаПеревозку.Записывать = Истина;
	
	ДвиженияСтатусыЗаявок = Движения.упСтатусыЗаявокНаПеревозкуГруза;
	ДвиженияСтатусыЗаявок.Очистить();	
	ДвиженияСтатусыЗаявок.Записывать = Истина;
	Движения.Записать();
		
	Документы.упКорректировкаЭтаповПеревозки.ИнициализироватьДанныеДокумента(Ссылка, РеквизитыОбъекта, ДополнительныеСвойства);
	
	упКорректировкаЭтаповПеревозки.СформироватьДвижениеЗаявкиКВыполнению(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упКорректировкаЭтаповПеревозки.СформироватьДвиженияПлановыеЭтапыМультимодальнойПеревозки(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
		
	упКорректировкаМаршрута.СформироватьДвижениеПрерыванияГрузовыхПотоков(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
	ДополнительныеСвойства.Вставить("РассчитатьСтатус", Истина);
	ДополнительныеСвойства.Вставить("ЗаписыватьСтатус", Ложь);
	ДополнительныеСвойства.Вставить("Статус", упРаботаСоСтатусами.ПолучитьТекущийСтатус(РеквизитыОбъекта.ЗаявкаНаПеревозкуГруза));
	ДополнительныеСвойства.Вставить("ДатаСтатуса", ТекущаяДатаСеанса());
	упУправленияЗаявками.СформироватьДвиженияСтатусЗаявки(ДополнительныеСвойства, РеквизитыОбъекта.ЗаявкаНаПеревозкуГруза, Движения, РеквизитыОбъекта, Отказ);	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
